export type TabName = "عن دروبي" | "المستخدم" | "الكابتن";

export interface FAQItem {
  question: string;
  answer: string;
  icon: string;
}

export const tabs: TabName[] = ["عن دروبي", "المستخدم", "الكابتن"];

export const faqData: Record<TabName, FAQItem[]> = {
  "عن دروبي": [
    {
      question: "ماهو تطبيق دروبي؟",
      answer:
        "دروبي هو تطبيق توصيل يتيح لك حجز رحلات بسهولة وأمان في مختلف مدن المملكة.",
      icon: "/images/Frame-card-contact.svg",
    },
    {
      question: "وش يميز دروبي عن غيره؟",
      answer:
        "الشفافية بالسعر، تنوع أنواع الرحلات، نظام أميال، وتجربة استخدام سهلة - هذا اللي يفرقنا.",
      icon: "/images/Frame-card-contact.svg",
    },
    {
      question: "ليه أختار دروبي؟",
      answer:
        "لأننا نوفر لك مشاوير بأسعار واضحة، أمان عالي، وخيارات تناسب احتياجك - وكل هذا بضغطة زر.",
      icon: "/images/Frame-card-contact.svg",
    },
    {
      question: "ماهي المناطق التي تخدمها دروبي؟",
      answer: "الإنطلاقة من جدة وسنستكمل الرحلة بإستهداف كافة مناطق المملكة.",
      icon: "/images/Frame-card-contact.svg",
    },
    {
      question: "أقدر أصير كابتن مع دروبي؟",
      answer:
        "أكيد ادخل صفحة “الكباتن” وسجل بخطوات بسيطة، وابدأ تستقبل مشاوير.",
      icon: "/images/Frame-card-contact.svg",
    },
  ],
  المستخدم: [
    {
      question: "كيف أقدر أطلب مشوار؟",
      answer:
        "بخطوات بسيطة وسهلة بعد تحميل التطبيق من المتجر، ثم تسجيل بياناتك للدخول، وبعد التحقق حدد وجهتك المطلوبة وطريقة الدفع، ثم استمتع بمشوارك.",
      icon: "/icons/users.svg",
    },
    {
      question: "كيف يتم احتساب سعر المشوار؟",
      answer:
        "يتم احتساب السعر بناءً على المسافة، ومدة الرحلة، ونوع الخدمة المختارة. يظهر لك السعر التقديري قبل تأكيد الطلب.",
      icon: "/icons/navigator.svg",
    },
    {
      question: "هل أقدر أجدول مشاويري؟",
      answer:
        "نعم، إذا مستعجل وتبي مشوارك الآن؟ عندك الحجز الفوري بخطوات بسيطة، أو خطط لمشاويرك من بدري وجدوله.",
      icon: "/icons/Money.svg",
    },
    {
      question: "كم يكلف المشوار؟",
      answer:
        "تختلف التكلفة بحسب المسافة والوقت، ولكن نحرص على توفير أفضل العروض وأقل الأسعار.",
      icon: "/icons/credit-card-pos.svg",
    },
    {
      question: "كيف أدفع قيمة المشوار؟",
      answer:
        "تقدر تدفع كاش، أو تستخدم بطاقتك البنكية إذا تحب. أهم شي تختار الطريقة اللي تريحك.",
      icon: "/icons/user-faq.svg",
    },
    {
      question: "هل يمكنني إلغاء الرحلة؟",
      answer:
        "نعم، يمكنك إلغاء الرحلة قبل وصول السائق. قد يتم تطبيق رسوم إلغاء في بعض الحالات.",
      icon: "/icons/cancel-square.svg",
    },
    {
      question: "كيف أكسب أميال؟",
      answer:
        "تكسب أميال مع كل رحلة، ويتم تحويلها تلقائيًا إلى رصيد في محفظتك داخل التطبيق.",
      icon: "/icons/coins-01.svg",
    },
    {
      question: "ماذا أفعل إذا واجهت مشكلة أثناء الرحلة؟",
      answer:
        "يمكنك الإبلاغ عن أي مشكلة من خلال التطبيق وسيتم التعامل معها فورًا من قبل فريق الدعم.",
      icon: "/icons/alert-02.svg",
    },
  ],
  الكابتن: [
    {
      question: "كيف أصير كابتن مع دروبي؟",
      answer:
        "قدم طلبك للقيادة عبر النموذج المخصص مع رفع المستندات المطلوبة، وبعد التحقق من توافق الشروط اللازمة فريقنا سيتواصل معكم لتأكيد الإنضمام.",
      icon: "/icons/user-account.svg",
    },
    {
      question: "متى أستلم أرباحي ككابتن؟",
      answer: "دروبي يوفر لك إمكانية صرف الأرباح يوميًا بدون خصم نسبة.",
      icon: "/icons/profit.svg",
    },
    {
      question: "كيف أتواصل مع مدير الدعم؟",
      answer:
        "خدمة العملاء متاحة دائمًا مهما كان وقتك، يمكنك التواصل مع فريق خدمة العملاء مباشرة عبر الواتساب من داخل التطبيق،",
      icon: "/icons/Support-24h.svg",
    },
    {
      question: "هل يوجد حد أدنى لساعات العمل؟",
      answer: "لا، تشتغل بالوقت اللي يناسبك - أنت تتحكم بجدولك.",
      icon: "/icons/user-account.svg",
    },
    {
      question: "كيف ابدأ أستقبل مشاوير؟",
      answer:
        "بعد تسجيل بياناتك واعتماد مستنداتك، تقدر تفعّل حالتك “متاح” وتبدأ تستقبل الطلبات مباشرة.",
      icon: "/icons/mobile-navigator-01.svg",
    },
    {
      question: "هل فيه نظام مكافآت للكباتن؟",
      answer:
        "إيه نعم كل ما زادت رحلاتك، تزيد مكافآتك وأميالك - وتتحول لرصيد في محفظتك.",
      icon: "/icons/Gift.svg",
    },
    {
      question: "أقدر أوقف الحساب مؤقتًا؟",
      answer:
        "أكيد، تقدر توقف استقبال الطلبات بأي وقت وترجع تفعّلها متى ما حبيت.",
      icon: "/icons/user-account.svg",
    },
  ],
};
