export const privacyPolicyData = [
  {
    category: "أ. معلومات الحساب",
    description: "نجمع البيانات عند إنشاء حسابك في دروبي أو تحديثه.",
    items: [
      "العنوان",
      "معلومات الاتصال (مثلاً البريد الإلكتروني أو رقم الهاتف)",
      "الاسم الأول واسم العائلة",
      "اسم المستخدم وكلمة المرور المستخدمان في تسجيل الدخول",
      "رقم الهاتف",
      "طريقة الدفع (بما في ذلك معلومات التحقق من الدفع المرتبطة بها)",
      "صورة الملف التعريفي",
      "الإعدادات (بما في ذلك إعدادات سهولة الاستخدام) والتفضيلات",
      "معلومات حول برنامج ولاء شركاء دروبي"
    ]
  },
  {
    category: "ب. البيانات الديموغرافية",
    description: "نجمع البيانات الديموغرافية حسب الضرورة لتفعيل ميزات معينة. على سبيل المثال: نجمع بيانات تاريخ الميلاد و/أو العمر للتحقق من أهليتك لاستخدام المنتجات أو الخدمات المقيدة بحسب العمر.",
    items: [
      "العمر أو تاريخ الميلاد",
      "الجنس أو الجنس المستدل عليه (بناءً على الاسم الأول)"
    ]
  },
  {
    category: "ج. معلومات التحقق من الهوية",
    description: "تشير هذه المعلومات إلى البيانات التي نجمعها للتحقق من حسابك أو من هويتك. قد يشمل ذلك البيانات البيومترية التي تسمح بتحديد هويتك بناءً على خصائصك الجسدية أو البيولوجية. على سبيل المثال، يتم إنشاء البيانات البيومترية عندما نستخدم تقنية التحقُّق من الوجه للتأكد من أن حسابك لا يستخدمه أي شخص آخر غيرك، أو بنفس عمرك أو لمنع إنشاء حسابات احتيالية.",
    items: [
      "مستندات إثبات الهوية الصادرة عن الحكومة، مثل رخص القيادة أو جوازات السفر (التي قد تحتوي على صور وأرقام الهوية وتاريخ انتهاء الصلاحية والبيانات الديموغرافية)",
      "صور ذاتية (سيلفي) مقدمة من المستخدم",
      "معلومات التحقق من الوجه"
    ]
  },
  {
    category: "د. المحتوى الذي يقدمه المستخدم",
    description: "يشير هذا إلى البيانات التي نجمعها منك في حالات محددة مثل استخدام الميزات التي تمكِّنك من إنشاء القوائم، تحميل الصور والتسجيلات (بما في ذلك تلك المُقدمة لأغراض دعم العملاء) ,تقديم التقييمات أو التعليقات للشركاء السائقين , الرد على استطلاع رأي.",
    items: [
      "التقييمات أو التعليقات",
      "الصور والتسجيلات الصوتية أو المرئية التي يتم تحميلها",
      "الردود على استطلاع الرأي"
    ]
  }
];

export const usageData = [
  {
    category: "أ. بيانات الموقع",
    description: "إذا طلبت مشواراً، فإننا نتتبع موقع السائق أثناء مشوارك، ونربط هذه البيانات بحسابك. يتيح لنا ذلك تحديد موقعك بدقة وعرضه أثناء مشوارك. نُحدد أيضاً موقعك التقريبي، ويمكننا تحديد موقعك بدقة إذا منحتنا الإذن بذلك من خلال إعدادات هاتفك. في حال منحنا الإذن بذلك، فسنجمع بيانات موقعك الدقيق من لحظة طلب المشوار أو الطلب وحتى انتهاء المشوار. ونجمع هذه البيانات أيضاً عندما يكون تطبيق دروبي مفتوحاً على شاشة هاتفك. يمكنك استخدام دروبي دون مشاركة بيانات موقعك الدقيق معنا. ولكن قد يتطلب ذلك جهداً إضافياً منك، إذ سيتوجب عليك إدخال موقعك بنفسك بدلاً من أن نقوم بذلك نيابة عنك.",
    items: [
      "الموقع التقريبي",
      "الموقع الدقيق"
    ]
  },
  {
    category: "ب. معلومات المشوار/الطلب",
    description: "تشير هذه المعلومات إلى البيانات التي نجمعها حول مشوارك أو طلبك، بما في ذلك الطلبات التي تُجرى عبر ميزات الدفع كضيف.",
    items: [
      "معلومات الدفع (بما في ذلك المبلغ الذي تم فرضه وطريقة الدفع)",
      "الإحصاءات المستخلصة من معلومات المشاوير/الطلبات السابقة، مثل المتوسطات، مثل متوسط حجم الطلب",
      "معدلات الإلغاء",
      "إجمالي عدد المشاوير",
      "تفاصيل المشوار أو الطلب، بما في ذلك التاريخ والوقت",
      "عنوانا الالتقاء والنزول المطلوبان",
      "المسافة المقطوعة",
      "قيمة الطلب",
      "المُعرّف الضريبي (حيثما تقتضي اللوائح المحلية ذلك)"
    ]
  },
  {
    category: "ج. بيانات الاستخدام",
    description: "يشير هذا المصطلح إلى البيانات المتعلقة بكيفية تفاعلك مع تطبيقات دروبي ومواقعها الإلكترونية.",
    items: [
      "أعطال التطبيق وأنشطة النظام الأخرى",
      "توارِيخ وأوقات الاستخدام",
      "ميزات التطبيق أو الصفحات المعروضة",
      "سجل البحث في دروبي",
      "البيانات المتعلقة بتفاعلاتك مع الحملات التسويقية والإعلانية"
    ]
  },
  {
    category: "د. بيانات الجهاز",
    description: "يشير هذا إلى البيانات الخاصة بالأجهزة التي تعتمد عليها عند استخدامك لتطبيق دروبي.",
    items: [
      "المعرّفات الإعلانية",
      "نوع المتصفح",
      "بيانات حركة الجهاز",
      "عنوان بروتوكول الإنترنت (IP) للجهاز أو معرّفات الجهاز الفريدة الأخرى",
      "طرازات الأجهزة",
      "بيانات شبكة الهاتف المحمول",
      "أنظمة التشغيل وإصداراتها",
      "اللغات المفضلة"
    ]
  },
  {
    category: "هـ. بيانات عمليات التواصل",
    description: "تشير هذه المعلومات إلى البيانات التي نجمعها عند (1) تواصلك مع دروبي للحصول على دعم العملاء، أو للإبلاغ عن مشكلة متعلقة بالسلامة، أو الاستفسارات الأخرى و (2) التواصل مع الشركاء السائقين من خلال تطبيقات دروبي.",
    items: [
      "نوع التواصل (هاتف أو رسالة نصية)",
      "المحتوى (بما في ذلك التسجيلات الصوتية وتسجيلات المكالمات الهاتفية ونصوص المكالمات وسجلات الدردشة)",
      "التاريخ والوقت"
    ]
  }
];
export const thirdPartyData = [
  {
    category: "أ. مسؤولو إنفاذ القانون ومسؤولو الصحة العامة والسلطات الحكومية الأخرى",
    description:"",
        items: [
      "الاسم",
      "معلومات الاتصال",
      "المعلومات المتعلقة بالتحقيقات التي تُجريها جهات إنفاذ القانون أو المؤسسات الصحية أو التحقيقات الأخرى"
    ]
  },
  {
    category: "ب. شركاء التسويق والمعلنون ومقدمو الخدمات",
    description: "ويشمل ذلك البنوك المرتبطة ببرامج استرداد التكاليف وموزعي البيانات.",
    items: [
      "بيانات الاستخدام، بما في ذلك مشاركتك في الحملات التسويقية والإعلانية",
      "جهة الاتصال",
      "الجهاز",
      "بيانات إضافية مثل الفئة العمرية، ومستوى الدخل التقريبي، والجنس، والاهتمامات العامة ونمط الحياة، وسلوك الشراء، وتفضيلات المشاهدة وعادات متابعة المحتوى"
    ]
  },
  {
    category: "ج. مقدمو الخدمات الذين يساعدوننا في التحقُّق من هويتك أو كشف عمليات الاحتيال",
    description:"",
    items: [
      "تأكيد ما إذا كانت معلومات حسابك تتعلق بأشخاص معروفين",
      "الاسم",
      "معلومات الاتصال",
      "تاريخ الميلاد",
      "المعلومات المتعلقة بشركة الاتصالات اللاسلكية المرتبطة بهاتفك، مثل اسم شركة الاتصالات ونوع الشبكة",
      "مستندات إثبات الهوية الصادرة عن الحكومة مثل رخص القيادة أو جوازات السفر والمعلومات ذات الصلة (مثل أرقام الهوية وتاريخ انتهاء الصلاحية والبيانات الديموغرافية)"
    ]
  },
  {
    category: "د. مالكو حسابات دروبي",
    description: "يشمل ذلك مالكي حسابات دروبي الذين يطلبون الخدمات نيابة عنك (مثل الأصدقاء أو أفراد العائلة)، أو الذين يسمحون لك بطلب الخدمات من خلال حساباتهم (مثل عملاء الشركات).",
    items: [
      "الاسم",
      "معلومات الاتصال",
      "الموقع",
      "معلومات المشوار/الطلب"
    ]
  },
  {
    category: "هـ. شركاء الأعمال في دروبي",
    description:"(إنشاء الحساب وإمكانية استخدامه، وواجهات برمجة التطبيقات). قد تتلقى شركة دروبي  بياناتك من شركاء الأعمال الذين تنشئ حسابك أو تستخدمه من خلالهم، مثل مزودي خدمات الدفع، أو منصات وسائل التواصل الاجتماعي، أو برامج الولاء للشركاء أو التطبيقات أو المواقع الإلكترونية التي تستخدم واجهات برمجة تطبيقات شركة دروبي أو التي تستخدم شركة دروبي واجهات برمجة تطبيقاتها.",
    items: [
      "يختلف ذلك حسب شريك العمل الذي أنشأت من خلاله حسابك في دروبي أو الذي تستخدمه لتسجيل الدخول إليه، أو وفقاً لواجهة برمجة التطبيقات (API) المستخدمة"
    ]
  },
  {
    category: "و. شركاء الأعمال في دروبي (بطاقات الخصم المباشر أو بطاقات الائتمان)",
    description:"قد تتلقى شركة دروبي بياناتك من شركاء الأعمال فيما يتعلق ببطاقات الخصم أو بطاقات الائتمان الصادرة عن مؤسسة مالية تتعاون مع دروبي، وذلك وفقاً لما هو موضح في الأحكام والشروط الخاصة بالبطاقة.",
    items: [
      "معلومات استخدام بطاقة الخصم أو بطاقة الائتمان"
    ]
  },
  {
    category: "ز. المستخدمون أو الأشخاص الآخرون الذين يقدمون المعلومات ذات الصلة بمطالبات دعم العملاء أو النزاعات",
    description:"",
    items: [
      "الاسم",
      "الأدلة المتعلقة بالحوادث أو النزاعات أو المطالبات أو الخلافات (التي قد تشمل صورك أو تسجيلاتك، بما في ذلك لقطات كاميرا لوحة القيادة ومقاطع الفيديو التي يرسلها الشركاء السائقون أو تسجيلات الفيديو التي يشاركها شركاء أساطيل السيارات)"
    ]
  },
  {
    category: "ح. المستخدمون المشاركون في برامج دعوات الانضمام إلى دروبي",
    description: "على سبيل المثال، إذا دعاك مستخدم آخر إلى دروبي، تتلقى بياناتك من هذا المستخدم.",
    items: [
      "معلومات الاتصال",
      "الاسم الأول واسم العائلة"
    ]
    },
  
];

export const dataUsagePurposes = [
  {
    category: "أ. إنشاء حسابك وتحديثه",
        description: "",
        items: [
      "الحساب",
      "البيانات الديموغرافية",
      "الموقع"
    ]
  },
  {
    category: "ب. تفعيل الخدمات والميزات",
    description: "تتضمن ما يلي: تفعيل نظام التوجيهات، وحساب المواعيد المقدّرة للوصول، وتتبُّع تقدم سير المشاوير، ومطابقتك مع الشركاء السائقين، وتفعيل الميزات التي تعتمد على مشاركة البيانات والربط بين الحسابات، وتسهيل حجز وعمليات الالتقاء والنزول وتحسينها.",
    items: [
      "الحساب",
      "البيانات الواردة من مصادر أخرى",
      "البيانات الديموغرافية",
      "الجهاز",
      "التقييمات"
    ]
  },
  {
    category: "د. تنفيذ الدفعات وتمكين الدفع وخدمات الأموال الإلكترونية",
      description:"",
    items: [
      "الحساب",
      "البيانات الواردة من مصادر أخرى",
      "البيانات الديموغرافية",
      "المشوار/الطلب"
    ]
  },
  {
    category: "هـ. تخصيص حسابك بما يتناسب مع تفضيلاتك",
    description: "على سبيل المثال، قد نقدم لك توصيات أو اقتراحات المشاوير، بناءً على طلباتك ومشاويرك ومواقع التوصيل السابقة.",
    items: [
      "الحساب",
      "الجهاز",
      "الموقع",
      "المشوار/الطلب",
      "الاستخدام"
    ]
  },
  {
    category: "و. تزويدك بآخر التحديثات بخصوص مشاويرك أو طلبات التوصيل وإصدار الإيصالات",
      description:"",
    items: [
      "الحساب",
      "المشوار/الطلب"
    ]
  },
  {
    category: "ز. إبقاؤك على اطلاع بالتغييرات التي تطرأ على شروطنا أو خدماتنا أو سياساتنا",
      description:"",
    items: [
      "الحساب",
      "المشوار/الطلب"
    ]
  },
  {
    category: "ح. تنفيذ العمليات اللازمة للحفاظ على خدماتنا",
    description: "ويشمل ذلك تحرّي مشكلات البرامج والمشكلات التشغيلية وإصلاحها.",
    items: [
      "الحساب",
      "الجهاز",
      "الاستخدام"
    ]
  }
];
export const safetyAndSecurityData = [
  {
    category: "أ. التحقُّق من حسابك أو هويتك أو امتثالك لمتطلبات السلامة",
    description: "يتضمن ذلك: التحقُّق من هويتك من خلال استخدام معلومات الحساب التي تُقدِّمها أثناء التسجيل (مثل الاسم ومعلومات الاتصال وتاريخ الميلاد ومعلومات الدفع) إلى جانب المعلومات من قواعد بيانات الهوية ومنع الاحتيال التابعة لجهات خارجية، والتحقُّق من عمرك، والتحقُّق من التزامك بمعايير السلامة.",
    items: [
      "الحساب",
      "البيانات الواردة من مصادر أخرى (قواعد بيانات الجهات الخارجية)",
      "البيانات الديموغرافية",
      "التحقُّق من هوية التسجيلات",
      "داخل وسيلة التنقُّل",
      "المحتوى الذي يقدمه المستخدم"
    ]
  },
  {
    category: "ب. منع الاحتيال والكشف عنه ومكافحته",
    description: "بما في ذلك الاحتيال الذي يتم من قِبل المستخدمين الضيوف.",
    items: [
      "الحساب",
      "التواصل بين المستخدمين",
      "البيانات الواردة من المصادر الأخرى (بيانات الشركاء السائقين)",
      "البيانات الديموغرافية",
      "الجهاز",
      "معلومات التحقُّق من الهوية",
      "الموقع",
      "المشوار/الطلب",
      "الاستخدام"
    ]
  },
  {
    category: "ج. التنبؤ والمساعدة في تجنب المطابقة بين المستخدمين التي قد تؤدي إلى زيادة احتمالية حدوث نزاع",
    description: "أو في الحالات التي يكون فيها أحد المستخدمين قد أعطى الآخر تقييماً منخفضاً (على سبيل المثال: تقييم بنجمة واحدة).",
    items: [
      "الحساب",
      "المشوار/الطلب (بما في ذلك معدلات الإلغاء)",
      "الاستخدام",
      "محتوى المستخدم (التقييمات والحوادث المُبلَّغ عنها)"
    ]
  },
  {
    category: "د. تقديم الدعم المباشر من خبراء السلامة أثناء إجراء المشاوير",
    description: "",
    items: [
      "الحساب (الهاتف، اسم المستخدم، تفاصيل وسيلة التنقُّل)",
      "الموقع",
      "المشوار/الطلب",
      "المحتوى الذي يقدمه المستخدم"
    ]
  },
  {
    category: "هـ. إنفاذ الأحكام والشروط المعمول بها في دروبي، وإرشادات دروبي، وغيرها من السياسات والمعايير التي يتم إبلاغك بها",
    description: "",
    items: [
      "الحساب",
      "التواصل",
      "البيانات الواردة من المصادر الأخرى (بيانات الشركاء السائقين)",
      "الجهاز",
      "معلومات التحقُّق من الهوية",
      "التسجيلات داخل وسيلة التنقُّل",
      "الموقع",
      "المشوار/الطلب",
      "الاستخدام"
    ]
  }
];
export const marketingData = [
  {
        category: "أ. تخصيص المراسلات والإعلانات المتعلقة بمنتجات وخدمات دروبي، بالإضافة إلى تلك التي تقدمها الشركات الأخرى",
      
  description: "استخدام بياناتك الشخصية لفهم اهتماماتك أو تفضيلاتك أو خصائصك، وتخصيص الإعلانات التي نعرضها لك. إرسال إشعارات مؤقتة تقترح وجهاتك أو متاجرك المفضلة، أو رسائل داخل التطبيق تعرض خصومات أو عروضاً ترويجية لمنتجات أو متاجر مشابهة لتلك التي طلبتها سابقاً. عرض الإعلانات المُخصَّصة على التطبيقات أو المواقع الإلكترونية لشركة دروبي أو الشركات الأخرى. ولإجراء ذلك، تنشئ دروبي مجموعات، أو جماهير، استناداً إلى اهتماماتك أو تفضيلاتك أو خصائصك، وتُعطي الأولوية للإعلان الذي ستعرضه لك استناداً إلى الجمهور الذي يرغب المعلنون في الوصول إليه. تخصيص الإعلانات الممولة أو عروض التوفير أو العروض الترويجية لتطبيق دروبي.",

    items: [
      "الحساب",
      "البيانات الواردة من مصادر أخرى",
      "البيانات الديموغرافية (بما في ذلك الجنس المستدل عليه)",
      "الجهاز",
      "الموقع",
      "المشوار/الطلب",
      "الاستخدام"
    ]
  },
  {
    category: "ب. عرض الإعلانات الموجهة استناداً إلى البيانات المتعلقة بمشوارك الحالي، بما في ذلك وقت الطلب والخدمات المطلوبة",
    description: "على سبيل المثال، إذا طلبت مشواراً للتوجه إلى سوبر ماركت معين، فقد تظهر لك إعلانات داخل التطبيق لمنتجات من جهات خارجية قد تكون موجودة في ذلك السوبر ماركت.",
    items: [
      "الحساب",
      "البيانات الواردة من مصادر أخرى",
      "البيانات الديموغرافية (بما في ذلك الجنس المستدل عليه)",
      "الجهاز",
      "الموقع",
      "معلومات المشوار/الطلب",
      "الاستخدام"
    ]
  },
  {
    category: "ج. قياس مدى فعالية التسويق والإعلانات، وتحسين حملاتنا الإعلانية والتسويقية",
    description: "تستخدم شركة دروبي بياناتك لتحديد ما إذا كان استخدامك للتطبيقات والمواقع مرتبطاً بحملات تسويقية محددة، ومساعدة المعلنين على فهم أداء حملاتهم الإعلانية.",
    items: [
      "الحساب",
      "الجهاز",
      "الاستخدام"
    ]
  }
];
export const communicationData = [
  {
    category: "التواصل بين المستخدمين",
    description: "على سبيل المثال، يجوز للشريك السائق إرسال رسالة نصية إليك أو الاتصال بك لتأكيد موقع الالتقاء، ويجوز لك الاتصال بالشريك السائق لاسترداد غرض مفقود.",
    items: [
      "الحساب",
      "الجهاز",
      "الاستخدام"
    ]
  }
];
export const customerSupportData = [
  {
    category: "البحث والتطوير ودعم العملاء",
    description: "يشمل ذلك التحقيق في مخاوف المستخدمين وتقديم الحلول المناسبة، بما في ذلك التحقيق في سوء السلوك الذي أبلغ عنه المستخدم (مثل الرسائل غير اللائقة أو الاحتيال)، ومراقبة وتحسين استجابات وعمليات دعم العملاء، وتحديد المشاركين المحتملين في الدراسات البحثية المتعلقة بمشاكل دعم العملاء. قد تستخدم دروبي أدوات الذكاء الاصطناعي لهذه الأغراض.",
    items: [
      "الحساب",
      "التواصل",
      "الجهاز",
      "معلومات التحقق من الهوية",
      "البيانات الواردة من المصادر الأخرى",
      "الموقع",
      "الاستخدام",
      "المحتوى الذي يقدمه المستخدم",
      "المشوار/الطلب",
      "التسجيلات داخل وسيلة التنقُّل"
    ]
  }
];
export const researchAndDevelopmentData = [
  {
    category: "التحليل والبحث وتطوير المنتجات",
    description: "نستخدم البيانات للتحليل والبحث وتطوير المنتجات، بما في ذلك تدريب نماذج التعلم الآلي. ويساهم ذلك في تحسين خدماتنا لتكون أكثر ملاءمة وسهولة في الاستخدام وتعزيز السلامة والأمان وتطوير خدمات وميزات جديدة.",
    items: [
      "الحساب",
      "التواصل",
      "البيانات الواردة من المصادر الأخرى",
      "البيانات الديموغرافية",
      "الجهاز",
      "معلومات التحقق من الهوية",
      "الموقع",
      "الاستخدام",
      "المحتوى الذي يقدمه المستخدم",
      "المشوار/الطلب",
      "التسجيلات داخل وسيلة التنقُّل"
    ]
  }
];
export const legalAndPoliticalData = [
  {
    category: "الاستبيانات والمراسلات غير التسويقية",
    description: "يشمَل ذلك الاستبيانات ومراسلات التواصل والاستفتاءات والعمليات المتعلقة بخدماتنا. على سبيل المثال: يجوز لنا إبلاغك بالإجراءات القادمة ذات الصلة بخدمات دروبي في المكان الذي تعيش فيه.",
    items: [
      "الحساب",
      "الموقع"
    ]
  }
];

export const legalProceedingsData = [
  {
    category: "الإجراءات القانونية والمتطلبات التنظيمية",
    description: "نستخدم البيانات للتحقيق في الادعاءات أو النزاعات المرتبطة باستخدام خدمات دروبي أو معالجتها، ولتلبية المتطلبات أو الامتثال للقوانين والأنظمة السارية، أو تراخيص التشغيل، أو الاتفاقيات، أو سياسات التأمين، أو استجابةً للإجراءات القانونية أو الطلبات الحكومية، بما في ذلك طلبات جهات إنفاذ القانون.",
    items: [
      "الحساب",
      "التواصل",
      "البيانات الواردة من المصادر الأخرى",
      "البيانات الديموغرافية",
      "الجهاز",
      "معلومات التحقق من الهوية",
      "الموقع",
      "الاستخدام",
      "المحتوى الذي يقدمه المستخدم",
      "المشوار/الطلب",
      "التسجيلات داخل وسيلة التنقُّل"
    ]
  }
];
export const dataSharingData = [
  {
    category: "سائقك",
        description: "",
        items: [
      "الحساب",
      "الاسم الأول",
      "التقييم",
      "موقعا الالتقاء و/أو النزول",
      "الإعدادات (بما في ذلك إعدادات سهولة الاستخدام) والتفضيلات"
    ]
  },
  {
    category: "الركاب الآخرون أثناء المشاوير",
        description: "",
    items: [
      "الحساب",
      "الاسم الأول"
    ]
  },
  {
    category: "مالك أي حساب تستخدمه في دروبي",
    description: "يشمل ذلك أيضاً في حال طلبت أو تلقيت مشواراً بصفتك مستخدماً زائراً. بالإضافة إلى ذلك، إذا أنشأت حساباً باستخدام عنوان بريد إلكتروني تابع لمالك حساب، فقد نشارك بيانات حسابك (مثل الاسم وعنوان البريد الإلكتروني) مع مالك هذا الحساب لمساعدتك في إضافة المشاوير. يجوز لنا أيضاً مشاركة المعلومات مع مالك هذا الحساب حول المشكلات المتعلقة بمشوارك، مثل حوادث السلامة أو الشكاوى.",
    items: [
      "الحساب",
      "المشوار/الطلب"
    ]
  },
  {
    category: "المستلمون الآخرون في طلبك الجماعي",
        description: "",
    items: [
      "الحساب",
      "الاسم الأول",
      "معلومات الطلب",
      "الأصناف المطلوبة"
    ]
  },
  {
    category: "الأشخاص الذين يدعونك للانضمام إلى دروبي",
    description: "قد نشارك بياناتك حسب الحاجة لتحديد مكافأتهم على دعوتهم لك للانضمام إلى دروبي.",
    items: [
      "المشوار/الطلب",
      "عدد المشاوير"
    ]
  }
];
export const thirdPartySharingData = [
  {
    category: "المستخدمون الذين تستخدم ميزات مشاركة البيانات معهم",
    description: "ويشمل ذلك الميزات التي تسمح لك بمشاركة الموعد المُقدَّر للوصول والموقع، أو تقاسم الأجرة.",
    items: [
      "اعتماداً على الميزة المستخدمة، قد تشمل ما يلي:",
      "الحساب",
      "الموقع",
      "المشوار"
    ]
  },
  {
    category: "شركاء دروبي",
    description: "نتشارك البيانات مع الشركات التي تتفاعل معها عبر دروبي من خلال تطبيقاتها أو مواقعها الإلكترونية، وذلك لأغراض العروض الترويجية، أو المسابقات، أو الخدمات المتخصصة.",
    items: [
      "حسب التطبيق أو الموقع الإلكتروني الذي تتصفحه عبر دروبي، ولأي هدف، قد تتضمن ما يلي:",
      "الحساب",
      "الجهاز",
      "المشوار"
    ]
  },
  {
    category: "خدمات الطوارئ",
    description: "نتيح لك إمكانية مشاركة بياناتك مع خدمات الشرطة والإطفاء والإسعاف في حالات الطوارئ أو بعد وقوع حوادث معينة.",
    items: [
      "الحساب",
      "الاسم",
      "رقم الهاتف",
      "الموقع",
      "المشوار",
      "مواقع الالتقاء/النزول المطلوبة"
    ]
  },
  {
    category: "شركات التأمين",
    description: "في حالة تورطك في حادث، أو الإبلاغ بوقوع حادث أو تقديم مطالبة لشركة تأمين متعلقة بخدمات دروبي، فإن دروبي ستشارك البيانات مع شركة التأمين المختصة بهدف تقييم المطالبة والتعامل معها بشكل مناسب.",
    items: [
      "البيانات اللازمة لتعديل المطالبة أو التعامل معها، والتي قد تشمل ما يلي:",
      "الحساب",
      "التواصل",
      "الجهاز",
      "الموقع",
      "المشوار",
      "الاستخدام",
      "المحتوى الذي يقدمه المستخدم"
    ]
  }
];

export const dataRetentionData = [
  {
    category: "الحساب",
        description: "",
    items: [
      "مدة صلاحية الحساب"
    ]
  },
  {
    category: "الاتصالات",
        description: "",
    items: [
      "الأقرب بين مدة صلاحية حسابك أو مرور 7 سنوات"
    ]
  },
  {
    category: "البيانات الديموغرافية",
        description: "",
    items: [
      "مدة صلاحية الحساب"
    ]
  },
  {
    category: "الجهاز",
        description: "",
    items: [
      "مدة صلاحية الحساب"
    ]
  },
  {
    category: "التحقُّق من الهوية",
        description: "",
    items: [
      "سنة واحدة لبطاقات الهوية الحكومية",
      "3 سنوات لصور السيلفي التي يرسلها المستخدمون"
    ]
  },
  {
    category: "بيانات الموقع",
        description: "",
    items: [
      "الأقرب بين مدة صلاحية حسابك أو مرور 7 سنوات"
    ]
  },
  {
    category: "المشوار/الطلب",
        description: "",
    items: [
      "الأقرب بين مدة صلاحية حسابك (أو مرور 7 سنوات)"
    ]
  },
  {
    category: "بيانات الاستخدام",
        description: "",
    items: [
      "الأقرب بين مدة صلاحية حسابك (أو مرور 7 سنوات)"
    ]
  }
];
export const legalBasesData = [
  {
    basis: "العقد",
    description: "عند إعداد حسابك في دروبي فإنك توافق على الالتزام بعقد تُحدد تفاصيله وفقاً للأحكام والشروط المعمول بها لدينا مما يضمن تقديم الخدمات التي تحتاجها بسلاسة وموثوقية. ينطبق هذا الأساس القانوني عندما يكون استخدام بياناتك ضرورياً لضمان تقديم الخدمات التي تطلبها وتنفيذ التزاماتنا المُتفق عليها بموجب هذا العقد.",
    usages: [
      "احتساب الأسعار للركاب/المستلمين وأجرة الشريك السائق/شريك التوصيل",
      "إنشاء حسابك أو تحديثه",
      "خدمة دعم العملاء",
      "إتاحة التواصل بينك وبين الشريك السائق",
      "تفعيل الخدمات والميزات",
      "تنفيذ العمليات اللازمة لضمان استمرارية خدماتنا",
      "تخصيص حسابك بما يتناسب مع تفضيلاتك",
      "تنفيذ عمليات الدفع",
      "إعلامك بآخر المستجدات بخصوص مشاويرك وإصدار الإيصالات، وإبقائك على اطلاع بالتغييرات التي تطرأ على شروطنا أو خدماتنا أو سياساتنا"
    ]
  },
  {
    basis: "الموافقة",
    description: "ينطبق هذا الأساس القانوني عندما نُبلغك بكيفية جمع بياناتك واستخدامها، ونحصل على موافقتك الطوعية على استخدام بياناتك (في بعض الحالات، نحصل عليها عندما تقوم بتفعيل الخيارات المتعلقة بجمع البيانات واستخدامها من خلال جهازك أو إعدادات تطبيق دروبي). في الحالات التي نعتمد فيها على موافقتك، يحق لك سحب هذه الموافقة في أي وقت. وعندئذٍ، سنتوقف عن جمع بياناتك واستخدامها.",
    usages: [
      "تخصيص الإعلانات المتعلقة بالمنتجات والخدمات المقدمة من الشركات الأخرى",
      "استخدام بيانات الصحة، أو البيانات الحساسة الأخرى، حسب المنطقة التي تعيش فيها"
    ]
  },
  {
    basis: "المصالح المشروعة",
    description: "ينطبق هذا الأساس القانوني عندما تستخدم شركة دروبي بياناتك لغرض مشروع (مثل ضمان السلامة والأمان ومنع الاحتيال ورصده)، وعندما يكون استخدامها للبيانات ضرورياً لتحقيق هذا الغرض، وعندما لا تكون المخاطر التي تتعرض لها خصوصيتك أكبر من الفائدة المرجوة من تحقيق هذا الغرض (على سبيل المثال، لأنك لا تتوقع استخدام شركة دروبي لبياناتك، أو لأن ذلك سيؤدي إلى منعك من ممارسة حقوقك).",
    usages: [
      "عرض الإعلانات الموجهة استناداً إلى البيانات المتعلقة بمشوارك الحالي",
      "قياس فعالية المراسلات والإعلانات التسويقية",
      "الاتصالات غير التسويقية",
      "تخصيص الإعلانات والمراسلات التسويقية المتعلقة بمنتجات وخدمات دروبي، بالإضافة إلى تلك التي تقدمها الشركات الأخرى",
      "التنبؤ بمدى التوافق بين المستخدمين والمساعدة في تجنب المطابقة التي قد تؤدي إلى زيادة خطر حدوث خلافات",
      "منع الاحتيال ورصده ومكافحته",
      "تقديم الدعم المباشر من خبراء السلامة خلال المشاوير",
      "إجراء الأبحاث وعمليات التطوير",
      "التحقق من حسابك أو هويتك أو امتثالك لمتطلبات السلامة"
    ]
  },
  {
    basis: "الالتزام القانوني",
    description: "ينطبق هذا الأساس القانوني عندما يُطلب منا استخدام بياناتك للامتثال للقانون.",
    usages: [
      "في سياق المتطلبات والإجراءات القانونية"
    ]
  }
];